您可以通过Ctrl+J或者右上角的机器人图标，打开AI助手侧边栏。
也可以在【墨池AI】页面体验墨池内置的Agent。
# 侧边栏的可靠学习伙伴
侧边栏的墨池AI，支持您一边阅读文档一边提问。
遇到问题，直接提问！墨池AI会自动获取您正在阅读的文章。
<img src="./assets/1789995870497-72872-9.png" alt="" width="873">

# 子文档
在比如全文翻译，全文改写的场景，你可能会期望基于某个父文档，新建子文档。
您可以直接指定对某个文档要求新建子文档，这样Agent会将子文档挂载在指定文档下。
![](./assets/1789996754400-65764-0.png)
# 快捷添加
您可以对某个笔记快捷“添加到AI助手”
<img src="./assets/1789998106090-65764-3.png" alt="" width="274">
# 出题
当辛苦写完一篇学习文档，您可以让墨池AI帮您出几道题目练练手。
![](./assets/1789998215775-65764-4.png)
您也可以生成交互试卷，实时检验。
<img src="./assets/1789998416374-65764-5.png" alt="" width="324">
交互试卷会自动挂载在原文档的子文档上。
<img src="./assets/1789998867495-65764-6.png" alt="" width="562">